{
  "structures": [
    {
      "id": "str-humerus-001",
      "canonicalName": "Humerus",
      "commonNames": ["Arm bone", "Upper arm bone"],
      "latinName": "Humerus",
      "pronunciationIpa": "/ˈhjuːmərəs/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-skeletal-001"],
      "structureType": "bone",
      "parentStructureId": null,
      "definitionBrief": "The long bone of the upper arm that extends from the shoulder to the elbow, articulating proximally with the scapula and distally with the radius and ulna.",
      "descriptionFull": "# Humerus\n\nThe humerus is the longest and largest bone of the upper extremity, extending from the shoulder to the elbow. It consists of a proximal end, shaft (body), and distal end.\n\n## Proximal End\nThe proximal end features the **head**, which is nearly hemispherical and articulates with the glenoid cavity of the scapula. The **anatomical neck** encircles the articular margin. The **greater tubercle** projects laterally with three distinct facets for muscle attachments, while the **lesser tubercle** projects anteriorly. The **intertubercular sulcus** (bicipital groove) runs between these tubercles, housing the tendon of the long head of biceps brachii. The **surgical neck**, located below the tubercles, is a common site of fractures.\n\n## Shaft\nThe shaft is cylindrical proximally and flattened distally. It exhibits several notable features: the **deltoid tuberosity** on the lateral surface (insertion of deltoid muscle), the **radial groove** (spiral groove) on the posterior surface where the radial nerve courses, and **medial and lateral borders** that provide muscle attachments.\n\n## Distal End\nThe distal end is flattened anteroposteriorly and features: the **capitulum** (laterally) which articulates with the radius, the **trochlea** (medially) which articulates with the ulna, the **radial fossa** and **coronoid fossa** anteriorly, and the **olecranon fossa** posteriorly. The **medial epicondyle** is prominent and provides attachment for flexor-pronator muscles and the ulnar collateral ligament, while the **lateral epicondyle** provides attachment for extensor-supinator muscles.",
      "clinicalSignificance": "**Fractures** are common, particularly at the surgical neck in elderly individuals with osteoporosis. Midshaft fractures may injure the radial nerve in the radial groove, causing wrist drop. Supracondylar fractures in children may damage the brachial artery and median nerve. The **medial epicondyle** is susceptible to avulsion fractures, particularly in throwing athletes ('Little League elbow'). Understanding humeral anatomy is crucial for shoulder arthroplasty and fracture management.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": "Nutrient arteries from brachial artery; proximal and distal metaphyses supplied by branches of the anterior and posterior circumflex humeral arteries and profunda brachii artery",
      "modelReference": "z-anatomy-humerus-001",
      "imageReferences": ["grays-1918-plate-209", "grays-1918-plate-210"],
      "difficultyRating": 2,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-radius-002",
      "canonicalName": "Radius",
      "commonNames": ["Lateral forearm bone"],
      "latinName": "Radius",
      "pronunciationIpa": "/ˈreɪdiəs/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-skeletal-001"],
      "structureType": "bone",
      "parentStructureId": null,
      "definitionBrief": "The lateral bone of the forearm that articulates proximally with the capitulum of the humerus and distally with the carpal bones, serving as the axis of forearm rotation.",
      "descriptionFull": "# Radius\n\nThe radius is the shorter of the two forearm bones, positioned on the lateral (thumb) side. It is narrow proximally and expands distally, opposite to the ulna.\n\n## Proximal End\nThe **radial head** is disc-shaped with a shallow superior concavity (fovea) that articulates with the capitulum of the humerus. The periphery of the head articulates with the radial notch of the ulna. The **radial neck** is a constricted area below the head. The **radial tuberosity** is a roughened projection on the anteromedial surface, serving as the insertion point for the biceps brachii tendon.\n\n## Shaft\nThe shaft is curved and has three borders (anterior, posterior, and interosseous) and three surfaces (anterior, posterior, and lateral). The **interosseous border** is sharp and gives attachment to the interosseous membrane connecting the radius and ulna.\n\n## Distal End\nThe distal end is expanded and quadrilateral, featuring the **ulnar notch** medially for articulation with the ulna, and the **carpal articular surface** inferiorly for the scaphoid and lunate bones. The **styloid process** projects distally from the lateral surface. The **dorsal tubercle** (Lister's tubercle) is palpable on the posterior surface and serves as a pulley for the extensor pollicis longus tendon.",
      "clinicalSignificance": "**Colles' fracture**, a distal radius fracture with dorsal displacement, is extremely common following falls on an outstretched hand (FOOSH injury), especially in osteoporotic elderly patients. **Radial head fractures** commonly occur from FOOSH injuries and may require surgical fixation or excision. The **scaphoid** articulation makes the radius critical in wrist biomechanics. Fractures may lead to radiocarpal or distal radioulnar joint instability.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": "Radial artery and its branches",
      "modelReference": "z-anatomy-radius-002",
      "imageReferences": ["grays-1918-plate-211"],
      "difficultyRating": 2,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-ulna-003",
      "canonicalName": "Ulna",
      "commonNames": ["Medial forearm bone"],
      "latinName": "Ulna",
      "pronunciationIpa": "/ˈʌlnə/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-skeletal-001"],
      "structureType": "bone",
      "parentStructureId": null,
      "definitionBrief": "The medial and longer bone of the forearm that articulates proximally with the trochlea of the humerus and forms the primary elbow joint.",
      "descriptionFull": "# Ulna\n\nThe ulna is the medial bone of the forearm and is the principal stabilizing bone at the elbow. Unlike the radius, it is thicker proximally and narrows distally.\n\n## Proximal End\nThe **olecranon process** is the large, prominent posterior projection that forms the bony point of the elbow and provides leverage for triceps brachii. The **coronoid process** is an anterior projection. Between these processes lies the **trochlear notch**, which articulates with the trochlea of the humerus to form the humeroulnar joint. The **radial notch** on the lateral surface articulates with the radial head. The **ulnar tuberosity** lies just distal to the coronoid process and receives the brachialis insertion.\n\n## Shaft\nThe shaft is triangular in cross-section with three borders (anterior, posterior, and interosseous) and three surfaces. The sharp **interosseous border** faces laterally and provides attachment for the interosseous membrane.\n\n## Distal End\nThe distal end features the small, rounded **ulnar head**, which articulates with the ulnar notch of the radius. The **styloid process** projects distally from the posteromedial aspect. Unlike the radius, the ulna does not directly articulate with carpal bones but is separated by the triangular fibrocartilage complex (TFCC).",
      "clinicalSignificance": "**Olecranon fractures** commonly result from direct trauma or falls and may require open reduction and internal fixation to preserve triceps function. **Monteggia fractures** involve proximal ulnar shaft fracture with radial head dislocation. **Nightstick fractures** are isolated ulnar shaft fractures from direct blows. The **ulnar styloid** may be fractured with distal radius fractures, potentially affecting TFCC integrity and distal radioulnar joint stability.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": "Ulnar and interosseous arteries",
      "modelReference": "z-anatomy-ulna-003",
      "imageReferences": ["grays-1918-plate-211"],
      "difficultyRating": 2,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-scapula-004",
      "canonicalName": "Scapula",
      "commonNames": ["Shoulder blade", "Wing bone"],
      "latinName": "Scapula",
      "pronunciationIpa": "/ˈskæpjələ/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-skeletal-001"],
      "structureType": "bone",
      "parentStructureId": null,
      "definitionBrief": "A large, flat, triangular bone that lies on the posterolateral aspect of the thorax, articulating with the humerus and clavicle to form the shoulder joint complex.",
      "descriptionFull": "# Scapula\n\nThe scapula is a triangular flat bone located on the posterior thoracic wall, positioned between the 2nd and 7th ribs. It does not articulate directly with the axial skeleton except through the clavicle.\n\n## Surfaces\nThe **costal (anterior) surface** is concave, forming the subscapular fossa. The **posterior surface** is divided by the **spine of the scapula** into the smaller **supraspinous fossa** (above) and larger **infraspinous fossa** (below). The spine continues laterally to form the **acromion**, which articulates with the clavicle.\n\n## Borders and Angles\nThe scapula has three borders: **superior**, **medial (vertebral)**, and **lateral (axillary)**. The **superior angle** and **inferior angle** are important palpable landmarks. The **lateral angle** is thickened and bears the **glenoid cavity** (glenoid fossa), a shallow, pear-shaped depression that articulates with the humeral head.\n\n## Processes\nThe **coracoid process** is a thick, curved projection extending anterolaterally from the superior border. It provides attachment for muscles and ligaments. The **supraglenoid tubercle** lies above the glenoid cavity (origin of long head of biceps), while the **infraglenoid tubercle** lies below it (origin of long head of triceps).\n\n## Notches\nThe **suprascapular notch** is located on the superior border, medial to the coracoid process, and is bridged by the superior transverse scapular ligament. The suprascapular nerve passes through this notch.",
      "clinicalSignificance": "**Scapular fractures** usually result from high-energy trauma and may indicate severe thoracic injuries. The **glenoid** may fracture with shoulder dislocations. **Scapular winging** occurs when the long thoracic nerve (supplying serratus anterior) is damaged, causing the medial border to project posteriorly. The **suprascapular notch** may entrap the suprascapular nerve, causing shoulder pain and weakness. Understanding scapular anatomy is essential for shoulder arthroplasty and rotator cuff surgery.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": "Suprascapular artery, dorsal scapular artery, circumflex scapular artery",
      "modelReference": "z-anatomy-scapula-004",
      "imageReferences": ["grays-1918-plate-202", "grays-1918-plate-203"],
      "difficultyRating": 3,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-clavicle-005",
      "canonicalName": "Clavicle",
      "commonNames": ["Collarbone"],
      "latinName": "Clavicula",
      "pronunciationIpa": "/ˈklævɪkəl/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-skeletal-001"],
      "structureType": "bone",
      "parentStructureId": null,
      "definitionBrief": "An S-shaped long bone that connects the upper limb to the axial skeleton by articulating medially with the sternum and laterally with the acromion of the scapula.",
      "descriptionFull": "# Clavicle\n\nThe clavicle is the only bony connection between the upper limb and the axial skeleton. It is an S-shaped bone that is convex anteriorly at its medial two-thirds and concave anteriorly at its lateral third.\n\n## Medial (Sternal) End\nThe medial end is enlarged and articulates with the manubrium of the sternum at the sternoclavicular joint. This is the only true synovial joint connecting the upper limb to the axial skeleton. The **sternal articular surface** is covered with fibrocartilage (not hyaline cartilage).\n\n## Shaft\nThe shaft is convex anteriorly in its medial two-thirds and concave anteriorly in its lateral third. The superior surface is smooth, while the inferior surface is roughened. The **subclavian groove** on the inferior surface marks the passage of the subclavius muscle. The **conoid tubercle** and **trapezoid line** on the inferior surface of the lateral third provide attachment for the conoid and trapezoid ligaments (components of the coracoclavicular ligament).\n\n## Lateral (Acromial) End\nThe lateral end is flattened and articulates with the acromion of the scapula at the acromioclavicular joint. The **acromial articular surface** is small and oval.\n\n## Function\nThe clavicle serves as a strut to hold the upper limb away from the trunk, transmits forces from the upper limb to the axial skeleton, provides attachment for muscles, and protects the neurovascular bundle to the upper limb.",
      "clinicalSignificance": "The clavicle is the **most commonly fractured bone** in the body, typically at the junction of the middle and lateral thirds. Fractures usually result from falls on the shoulder or outstretched hand. The lateral fragment is typically displaced inferiorly by the weight of the arm and medially by the pectoralis major, while the medial fragment is pulled superiorly by the sternocleidomastoid. Most clavicular fractures heal well with conservative management. The **subclavian vessels and brachial plexus** lie deep to the clavicle and may be injured in displaced fractures.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": "Suprascapular artery, thoracoacromial artery",
      "modelReference": "z-anatomy-clavicle-005",
      "imageReferences": ["grays-1918-plate-201"],
      "difficultyRating": 2,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-biceps-brachii-006",
      "canonicalName": "Biceps brachii",
      "commonNames": ["Biceps"],
      "latinName": "Musculus biceps brachii",
      "pronunciationIpa": "/ˈbaɪsɛps ˈbreɪkiaɪ/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-muscular-002"],
      "structureType": "muscle",
      "parentStructureId": null,
      "definitionBrief": "A two-headed muscle of the anterior arm that flexes the elbow and supinates the forearm, with its long head contributing to shoulder stability.",
      "descriptionFull": "# Biceps Brachii\n\nThe biceps brachii is the most prominent muscle of the anterior compartment of the arm, named for its two heads of origin. It is a powerful supinator and elbow flexor.\n\n## Origin\n**Long head**: Supraglenoid tubercle of the scapula. The tendon passes through the shoulder joint capsule and descends in the intertubercular sulcus (bicipital groove) of the humerus.\n\n**Short head**: Coracoid process of the scapula (together with coracobrachialis).\n\n## Insertion\nBoth heads form a single muscle belly that inserts primarily into the **radial tuberosity** via a strong tendon. A secondary insertion is the **bicipital aponeurosis** (lacertus fibrosus), which is a broad fascial expansion that blends with the deep fascia on the medial side of the forearm.\n\n## Actions\n1. **Primary supinator** of the forearm when elbow is flexed (most powerful supinator)\n2. **Flexion of elbow** (particularly effective when forearm is supinated)\n3. **Weak flexor** of the shoulder (long head)\n4. **Stabilization** of the humeral head in the glenoid cavity (long head)\n\n## Clinical Correlations\nThe biceps is superficial and easily palpated. The **bicipital aponeurosis** protects the median nerve and brachial artery in the cubital fossa. The long head tendon is prone to tendinitis and rupture, particularly where it passes through the bicipital groove.",
      "clinicalSignificance": "**Rupture of the long head tendon** causes a 'Popeye' deformity due to distal retraction of the muscle belly. This typically occurs in older individuals and usually doesn't require surgical repair as the short head maintains function. **Bicipital tendinitis** causes anterior shoulder pain that worsens with overhead activities. The **biceps reflex** (C5-C6) is tested by tapping the biceps tendon in the cubital fossa. **Distal biceps tendon rupture** is less common but causes significant loss of supination strength and requires surgical repair in active individuals.",
      "origin": "Long head: Supraglenoid tubercle of scapula; Short head: Coracoid process of scapula",
      "insertion": "Radial tuberosity and bicipital aponeurosis",
      "action": "Supination of forearm; flexion of elbow; weak shoulder flexion",
      "innervation": "Musculocutaneous nerve (C5, C6)",
      "bloodSupply": "Brachial artery and its muscular branches",
      "modelReference": "z-anatomy-biceps-brachii-006",
      "imageReferences": ["grays-1918-plate-417", "grays-1918-plate-418"],
      "difficultyRating": 2,
      "prerequisiteIds": ["str-humerus-001", "str-radius-002", "str-scapula-004"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-triceps-brachii-007",
      "canonicalName": "Triceps brachii",
      "commonNames": ["Triceps"],
      "latinName": "Musculus triceps brachii",
      "pronunciationIpa": "/ˈtraɪsɛps ˈbreɪkiaɪ/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-muscular-002"],
      "structureType": "muscle",
      "parentStructureId": null,
      "definitionBrief": "A three-headed muscle forming the entire posterior compartment of the arm that extends the elbow and contributes to shoulder extension and adduction.",
      "descriptionFull": "# Triceps Brachii\n\nThe triceps brachii is the sole muscle of the posterior compartment of the arm and is the principal extensor of the elbow. It has three heads that converge to form a common tendon.\n\n## Origin\n**Long head**: Infraglenoid tubercle of the scapula (only head that crosses the shoulder joint)\n\n**Lateral head**: Posterior surface of the humerus, superior to the radial groove\n\n**Medial head**: Posterior surface of the humerus, inferior to the radial groove (deepest and most active head)\n\n## Insertion\nAll three heads converge to insert via a common tendon into the **olecranon process** of the ulna. Some fibers blend with the antebrachial fascia.\n\n## Actions\n1. **Extension of the elbow** (all three heads)\n2. **Extension of the shoulder** (long head only)\n3. **Adduction of the shoulder** (long head only)\n4. **Stabilization of shoulder joint** (long head)\n\n## Anatomical Relationships\nThe **radial nerve and profunda brachii artery** pass through the triangular interval between the long head and lateral head, then spiral around the humerus in the radial groove between the lateral and medial heads.",
      "clinicalSignificance": "The **triceps reflex** (C7-C8) is tested by tapping the triceps tendon just proximal to the olecranon. **Radial nerve palsy** results in loss of triceps function and inability to extend the elbow (though gravity can assist extension when the arm is elevated). **Olecranon bursitis** may develop between the triceps tendon and skin. **Midshaft humeral fractures** may damage the radial nerve as it passes through the radial groove between the triceps heads, causing wrist drop and loss of triceps function.",
      "origin": "Long head: Infraglenoid tubercle of scapula; Lateral head: Posterior humerus above radial groove; Medial head: Posterior humerus below radial groove",
      "insertion": "Olecranon process of ulna",
      "action": "Extension of elbow; extension and adduction of shoulder (long head)",
      "innervation": "Radial nerve (C7, C8)",
      "bloodSupply": "Profunda brachii artery (deep brachial artery)",
      "modelReference": "z-anatomy-triceps-brachii-007",
      "imageReferences": ["grays-1918-plate-419"],
      "difficultyRating": 2,
      "prerequisiteIds": ["str-humerus-001", "str-ulna-003", "str-scapula-004"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-deltoid-008",
      "canonicalName": "Deltoid",
      "commonNames": ["Shoulder muscle"],
      "latinName": "Musculus deltoideus",
      "pronunciationIpa": "/ˈdɛltɔɪd/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-muscular-002"],
      "structureType": "muscle",
      "parentStructureId": null,
      "definitionBrief": "A large, multipennate muscle that covers the shoulder joint and is the primary abductor of the arm, with anterior and posterior fibers contributing to flexion and extension respectively.",
      "descriptionFull": "# Deltoid\n\nThe deltoid is a thick, powerful, triangular muscle that forms the rounded contour of the shoulder. It is named for its resemblance to the Greek letter delta (Δ). The muscle is functionally divided into three parts: anterior, middle (acromial), and posterior.\n\n## Origin\n**Anterior fibers**: Anterior border and superior surface of the lateral third of the clavicle\n\n**Middle fibers**: Lateral margin and superior surface of the acromion\n\n**Posterior fibers**: Inferior lip of the posterior border of the spine of the scapula\n\n## Insertion\nAll three parts converge to insert on the **deltoid tuberosity** on the lateral surface of the humeral shaft.\n\n## Actions\nThe deltoid has different actions depending on which fibers are activated:\n\n**Anterior fibers**: Flexion, medial rotation, and horizontal adduction of the arm\n\n**Middle (acromial) fibers**: Primary abductor of the arm (beyond 15° initiated by supraspinatus); most powerful from 90° to 180°\n\n**Posterior fibers**: Extension, lateral rotation, and horizontal abduction of the arm\n\n**All fibers together**: Abduction of the arm\n\n## Clinical Relevance\nThe deltoid is the preferred site for intramuscular injections in the upper limb due to its thick muscle mass and accessibility.",
      "clinicalSignificance": "**Axillary nerve injury** (C5-C6), often from anterior shoulder dislocation or proximal humeral fractures, results in deltoid paralysis with loss of arm abduction beyond 15° and a characteristic 'flat shoulder' appearance. Sensory loss over the lateral shoulder ('regimental badge area') accompanies motor loss. **Deltoid atrophy** may occur with disuse or denervation. The muscle can be used as a **pedicled flap** in reconstructive surgery. Understanding deltoid anatomy is crucial for **shoulder arthroplasty** and **rotator cuff repair**.",
      "origin": "Lateral third of clavicle, acromion, and spine of scapula",
      "insertion": "Deltoid tuberosity of humerus",
      "action": "Anterior: flexion, medial rotation; Middle: abduction; Posterior: extension, lateral rotation",
      "innervation": "Axillary nerve (C5, C6)",
      "bloodSupply": "Posterior circumflex humeral artery, deltoid branch of thoracoacromial artery",
      "modelReference": "z-anatomy-deltoid-008",
      "imageReferences": ["grays-1918-plate-414", "grays-1918-plate-415"],
      "difficultyRating": 2,
      "prerequisiteIds": ["str-humerus-001", "str-scapula-004", "str-clavicle-005"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-brachialis-009",
      "canonicalName": "Brachialis",
      "commonNames": [],
      "latinName": "Musculus brachialis",
      "pronunciationIpa": "/ˌbreɪkiˈælɪs/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-muscular-002"],
      "structureType": "muscle",
      "parentStructureId": null,
      "definitionBrief": "A pure elbow flexor muscle that lies deep to the biceps brachii and is the most powerful flexor of the elbow joint regardless of forearm position.",
      "descriptionFull": "# Brachialis\n\nThe brachialis is a strong elbow flexor that lies immediately deep to the biceps brachii in the anterior compartment of the arm. Unlike the biceps, it is a pure flexor with no supination action.\n\n## Origin\nDistal half of the anterior surface of the **humerus** and the adjacent medial and lateral intermuscular septa.\n\n## Insertion\n**Coronoid process** of the ulna and the **ulnar tuberosity**. The insertion is entirely on the ulna, making this muscle a pure elbow flexor.\n\n## Actions\n**Primary flexion of the elbow joint**. The brachialis is active in all forms of elbow flexion regardless of forearm position (pronation, supination, or neutral). It is considered the 'workhorse' of elbow flexion because it works consistently without the position-dependent variation seen with biceps and brachioradialis.\n\n## Anatomical Relationships\nThe **musculocutaneous nerve** typically pierces the brachialis muscle 5-8 cm distal to the coracoid process. The **radial nerve** and **profunda brachii artery** pass along the lateral border of the muscle in the radial groove. The **brachial artery** and **median nerve** lie superficial to the muscle.",
      "clinicalSignificance": "The brachialis is the **strongest pure flexor of the elbow** and maintains function even when the biceps and brachioradialis are weakened. **Myositis ossificans** (heterotopic bone formation) may develop in the brachialis following elbow trauma or dislocation, particularly with aggressive passive range of motion exercises. **Compartment syndrome** of the anterior arm may involve the brachialis. The muscle's consistent architecture makes it useful for **muscle transfers** in reconstructive procedures.",
      "origin": "Distal half of anterior humerus",
      "insertion": "Coronoid process and ulnar tuberosity of ulna",
      "action": "Flexion of elbow",
      "innervation": "Musculocutaneous nerve (C5, C6) with occasional small contribution from radial nerve",
      "bloodSupply": "Radial recurrent artery, brachial artery muscular branches",
      "modelReference": "z-anatomy-brachialis-009",
      "imageReferences": ["grays-1918-plate-417"],
      "difficultyRating": 2,
      "prerequisiteIds": ["str-humerus-001", "str-ulna-003"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-brachioradialis-010",
      "canonicalName": "Brachioradialis",
      "commonNames": [],
      "latinName": "Musculus brachioradialis",
      "pronunciationIpa": "/ˌbreɪkioʊˌreɪdiˈælɪs/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-muscular-002"],
      "structureType": "muscle",
      "parentStructureId": null,
      "definitionBrief": "A superficial forearm muscle that paradoxically belongs to the posterior compartment but flexes the elbow, being most effective when the forearm is in mid-pronation.",
      "descriptionFull": "# Brachioradialis\n\nThe brachioradialis is the most superficial muscle of the radial (lateral) side of the forearm. Despite being located in the posterior (extensor) compartment and receiving innervation from the radial nerve, it is a flexor of the elbow.\n\n## Origin\nProximal two-thirds of the **lateral supracondylar ridge of the humerus** and the adjacent **lateral intermuscular septum**.\n\n## Insertion\nLateral aspect of the distal end of the **radius**, just proximal to the styloid process.\n\n## Actions\n1. **Flexion of the elbow**: Most effective when the forearm is in the mid-prone (neutral) position\n2. **Returns forearm to neutral** from extremes of pronation or supination (acting as both pronator and supinator depending on starting position)\n\nThe muscle is most active during fast flexion movements or when flexing against resistance with the forearm in the mid-prone position.\n\n## Anatomical Relationships\nThe **radial nerve** passes deep to the brachioradialis in the forearm. The **cephalic vein** runs along the lateral border of the muscle. The **radial artery** lies along the medial border of the muscle in the middle third of the forearm and is easily palpable here for taking the radial pulse.",
      "clinicalSignificance": "The **brachioradialis reflex** (C5-C6, primarily C6) is tested by tapping the distal brachioradialis tendon proximal to the wrist, causing forearm flexion and supination. This reflex is also called the **radial reflex** or **supinator reflex**. The tendon is easily palpable and sometimes visible at the wrist when making a fist. The **radial artery** lies just deep to the medial border of the muscle, making this an important landmark for radial artery catheterization and pulse palpation. **Muscle tears** may occur in weightlifters or gymnasts.",
      "origin": "Lateral supracondylar ridge of humerus",
      "insertion": "Lateral distal radius above styloid process",
      "action": "Flexion of elbow; returns forearm to neutral position",
      "innervation": "Radial nerve (C5, C6)",
      "bloodSupply": "Radial recurrent artery, radial artery",
      "modelReference": "z-anatomy-brachioradialis-010",
      "imageReferences": ["grays-1918-plate-420"],
      "difficultyRating": 3,
      "prerequisiteIds": ["str-humerus-001", "str-radius-002"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-brachial-plexus-011",
      "canonicalName": "Brachial plexus",
      "commonNames": [],
      "latinName": "Plexus brachialis",
      "pronunciationIpa": "/ˈbreɪkiəl ˈplɛksəs/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-nervous-003"],
      "structureType": "nerve",
      "parentStructureId": null,
      "definitionBrief": "A complex network of nerves formed by the ventral rami of spinal nerves C5-T1 that innervates the entire upper limb through a series of roots, trunks, divisions, cords, and branches.",
      "descriptionFull": "# Brachial Plexus\n\nThe brachial plexus is the major nerve network supplying the upper limb. It is formed by the ventral rami of spinal nerves C5, C6, C7, C8, and T1, with occasional contributions from C4 and T2.\n\n## Organization (Proximal to Distal)\nThe plexus is traditionally remembered by the mnemonic 'Randy Travis Drinks Cold Beer':\n\n### 1. Roots (5)\n- C5, C6, C7, C8, T1 ventral rami emerge between the anterior and middle scalene muscles\n\n### 2. Trunks (3)\n- **Superior trunk**: C5 + C6\n- **Middle trunk**: C7 (continues alone)\n- **Inferior trunk**: C8 + T1\n\nThe trunks pass through the posterior triangle of the neck, above the first rib and behind the clavicle.\n\n### 3. Divisions (6)\n- Each trunk divides into **anterior** and **posterior** divisions\n- Anterior divisions supply flexor compartments\n- Posterior divisions supply extensor compartments\n\n### 4. Cords (3)\nNamed for their relationship to the axillary artery:\n- **Lateral cord**: Anterior divisions of superior and middle trunks (C5-C7)\n- **Posterior cord**: All three posterior divisions (C5-T1)\n- **Medial cord**: Anterior division of inferior trunk (C8-T1)\n\n### 5. Branches (Terminal and Collateral)\nTerminal branches from the cords include:\n- **Lateral cord**: Musculocutaneous nerve, lateral root of median nerve\n- **Posterior cord**: Axillary nerve, radial nerve\n- **Medial cord**: Ulnar nerve, medial root of median nerve\n\n## Supraclavicular Branches\n- Dorsal scapular nerve (C5)\n- Long thoracic nerve (C5-C7)\n- Suprascapular nerve (C5-C6)\n- Nerve to subclavius (C5-C6)\n\n## Anatomical Relations\nThe plexus passes between the anterior and middle scalene muscles, over the first rib, under the clavicle, and through the axilla adjacent to the axillary artery.",
      "clinicalSignificance": "**Erb's palsy** (Erb-Duchenne paralysis) results from injury to the superior trunk (C5-C6), commonly from forceful shoulder depression (difficult childbirth, motorcycle accidents). The arm hangs in the 'waiter's tip' position (adducted, internally rotated, extended elbow, pronated forearm). **Klumpke's palsy** involves the inferior trunk (C8-T1), causing a 'claw hand' deformity from intrinsic muscle paralysis. **Thoracic outlet syndrome** involves compression of the plexus between the scalene muscles or under the clavicle. **Stingers** or 'burners' are temporary brachial plexus injuries common in contact sports. **Complete brachial plexus injury** results in a flail, insensate upper limb.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": "Ventral rami of C5-T1 spinal nerves",
      "bloodSupply": "Subclavian artery, axillary artery branches",
      "modelReference": "z-anatomy-brachial-plexus-011",
      "imageReferences": ["grays-1918-plate-808", "grays-1918-plate-809"],
      "difficultyRating": 5,
      "prerequisiteIds": [],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-musculocutaneous-nerve-012",
      "canonicalName": "Musculocutaneous nerve",
      "commonNames": [],
      "latinName": "Nervus musculocutaneus",
      "pronunciationIpa": "/ˌmʌskjuloʊkjuːˈteɪniəs nɜːrv/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-nervous-003"],
      "structureType": "nerve",
      "parentStructureId": "str-brachial-plexus-011",
      "definitionBrief": "A terminal branch of the lateral cord of the brachial plexus (C5-C7) that innervates the anterior arm muscles and provides sensation to the lateral forearm.",
      "descriptionFull": "# Musculocutaneous Nerve\n\nThe musculocutaneous nerve is a major branch of the brachial plexus arising from the lateral cord. It is both a motor nerve to the anterior compartment of the arm and a sensory nerve to the lateral forearm.\n\n## Origin and Course\nThe nerve arises from the **lateral cord** of the brachial plexus, receiving contributions from **C5, C6, and C7** nerve roots. It emerges at the lateral border of pectoralis minor and descends laterally.\n\n**Characteristic course**: The nerve pierces the **coracobrachialis muscle** approximately 5-8 cm distal to the coracoid process (an important anatomical landmark). It then passes between the biceps brachii and brachialis muscles, descending toward the elbow.\n\n## Motor Innervation\nThe musculocutaneous nerve supplies all three muscles of the anterior compartment of the arm:\n1. **Coracobrachialis** (pierces this muscle)\n2. **Biceps brachii**\n3. **Brachialis** (main supply; may also receive contribution from radial nerve)\n\n## Sensory Innervation\nAfter emerging from the lateral border of the biceps tendon at the elbow, the nerve continues as the **lateral cutaneous nerve of the forearm** (lateral antebrachial cutaneous nerve). This provides sensation to the skin over the lateral aspect of the forearm from elbow to wrist.\n\n## Anatomical Relations\n- Travels with the lateral cord and axillary artery initially\n- Pierces coracobrachialis\n- Runs between biceps and brachialis\n- Emerges between biceps tendon and brachioradialis at the elbow",
      "clinicalSignificance": "**Isolated injury** to the musculocutaneous nerve is rare but may occur from penetrating trauma, humeral fractures, or during surgical procedures (shoulder surgery, brachial plexus surgery). **Clinical presentation** includes: weakness of elbow flexion (biceps and brachialis paralyzed, but brachioradialis partially compensates), weakness of forearm supination (biceps paralyzed), and sensory loss over the lateral forearm. **Coracobrachialis** may be selectively denervated in patients with proximal nerve injury. The nerve's consistent anatomical path makes it useful as a landmark in surgical approaches to the shoulder and arm.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": "Lateral cord of brachial plexus (C5, C6, C7)",
      "bloodSupply": "Brachial artery branches",
      "modelReference": "z-anatomy-musculocutaneous-012",
      "imageReferences": ["grays-1918-plate-813"],
      "difficultyRating": 3,
      "prerequisiteIds": ["str-brachial-plexus-011"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-radial-nerve-013",
      "canonicalName": "Radial nerve",
      "commonNames": [],
      "latinName": "Nervus radialis",
      "pronunciationIpa": "/ˈreɪdiəl nɜːrv/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-nervous-003"],
      "structureType": "nerve",
      "parentStructureId": "str-brachial-plexus-011",
      "definitionBrief": "The largest terminal branch of the brachial plexus arising from the posterior cord (C5-T1), innervating all extensor muscles of the upper limb and providing sensation to the posterior arm, forearm, and dorsal hand.",
      "descriptionFull": "# Radial Nerve\n\nThe radial nerve is the largest branch of the brachial plexus and the principal nerve of the posterior compartments of the arm and forearm. It is the continuation of the posterior cord.\n\n## Origin and Course\nArises from the **posterior cord** of the brachial plexus, receiving fibers from **all five roots (C5-T1)**, though C6-C8 predominate functionally.\n\n**Course in the arm**:\n1. Descends posterior to the axillary artery\n2. Enters the arm between the long and medial heads of triceps\n3. **Spirals around the posterior humerus** in the radial groove (spiral groove) with the profunda brachii artery\n4. Passes between the lateral and medial heads of triceps\n5. Pierces the lateral intermuscular septum to enter the anterior compartment\n6. Descends between brachialis (medially) and brachioradialis/extensor carpi radialis longus (laterally)\n7. At the elbow, divides into **superficial** (sensory) and **deep** (motor) branches\n\n## Motor Innervation\n\n**In the arm**:\n- All three heads of triceps brachii (via branches before spiral groove)\n- Anconeus\n\n**In the forearm** (via deep branch/posterior interosseous nerve):\n- Brachioradialis\n- Extensor carpi radialis longus\n- Extensor carpi radialis brevis\n- Supinator\n- All muscles in the posterior compartment of the forearm (extensors and abductor pollicis longus)\n\n## Sensory Innervation\n- **Posterior cutaneous nerve of arm**: Posterior arm\n- **Inferior lateral cutaneous nerve of arm**: Lower lateral arm\n- **Posterior cutaneous nerve of forearm**: Posterior forearm\n- **Superficial radial nerve**: Dorsal-lateral hand (first web space between thumb and index finger is hallmark area)",
      "clinicalSignificance": "**Radial nerve palsy** is the most common peripheral nerve injury in the upper limb. **Causes** include: (1) **'Saturday night palsy'** from prolonged compression in the axilla (falling asleep with arm over chair), (2) **Midshaft humeral fractures** damaging the nerve in the radial groove, (3) **Crutch palsy** from prolonged axillary pressure, and (4) **Intraoperative positioning** injuries.\n\n**Clinical presentation** depends on injury level:\n- **High injury** (axilla): Loss of triceps (no elbow extension), loss of all wrist/finger extensors (**wrist drop**), loss of thumb extension/abduction, sensory loss on posterior arm, forearm, and hand\n- **Mid-arm injury** (spiral groove): Triceps spared, but wrist drop and finger drop present\n- **Forearm injury** (posterior interosseous syndrome): Pure motor loss, no sensory deficit, wrist extension preserved (ECRL spared) but weakened and radially deviated\n\n**Wrist drop** is the characteristic sign, with inability to extend the wrist, fingers, or thumb. **Sensation over the first dorsal web space** is the most reliable sensory test.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": "Posterior cord of brachial plexus (C5-T1, predominantly C6-C8)",
      "bloodSupply": "Profunda brachii artery, radial recurrent artery",
      "modelReference": "z-anatomy-radial-nerve-013",
      "imageReferences": ["grays-1918-plate-813", "grays-1918-plate-814"],
      "difficultyRating": 4,
      "prerequisiteIds": ["str-brachial-plexus-011", "str-humerus-001"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-median-nerve-014",
      "canonicalName": "Median nerve",
      "commonNames": [],
      "latinName": "Nervus medianus",
      "pronunciationIpa": "/ˈmiːdiən nɜːrv/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-nervous-003"],
      "structureType": "nerve",
      "parentStructureId": "str-brachial-plexus-011",
      "definitionBrief": "A major nerve formed by contributions from both lateral and medial cords of the brachial plexus (C6-T1) that innervates most forearm flexors and thenar muscles, and provides sensation to the lateral palm and digits.",
      "descriptionFull": "# Median Nerve\n\nThe median nerve is formed by the union of terminal branches from both the lateral and medial cords of the brachial plexus. It is the principal nerve of the anterior forearm and provides critical motor and sensory innervation to the hand.\n\n## Formation and Course in the Arm\nFormed by the union of:\n- **Lateral root** from the lateral cord (C6, C7)\n- **Medial root** from the medial cord (C8, T1)\n\nThese roots join anterior to or lateral to the axillary artery, forming the median nerve. The nerve then:\n1. Descends lateral to the brachial artery in the proximal arm\n2. **Crosses anterior to the brachial artery** (usually at mid-arm)\n3. Descends medial to the brachial artery in the distal arm\n4. **Has no branches in the arm** (this is clinically important)\n\n## Course in the Forearm\nAt the elbow:\n1. Enters the forearm between the two heads of **pronator teres**\n2. Gives off the **anterior interosseous nerve** (important motor branch)\n3. Descends between flexor digitorum superficialis (superficial) and flexor digitorum profundus (deep)\n4. Becomes superficial just proximal to the wrist, lying between flexor carpi radialis (laterally) and palmaris longus (medially) tendons\n5. Passes through the **carpal tunnel** deep to the flexor retinaculum\n\n## Motor Innervation\n\n**In the forearm** (via main nerve and anterior interosseous branch):\n- Pronator teres\n- Flexor carpi radialis\n- Palmaris longus\n- Flexor digitorum superficialis\n- Lateral half of flexor digitorum profundus (digits 2-3)\n- Flexor pollicis longus\n- Pronator quadratus\n\n**Mnemonic**: 'LOAF' muscles in the hand:\n- **L**umbricals (lateral two, digits 2-3)\n- **O**pponens pollicis\n- **A**bductor pollicis brevis\n- **F**lexor pollicis brevis (superficial head)\n\n## Sensory Innervation\n- **Palmar cutaneous branch**: Lateral palm (arises proximal to carpal tunnel, doesn't pass through it)\n- **Digital cutaneous branches**: Palmar surface of lateral 3½ digits (thumb, index, middle, lateral half of ring) and dorsal tips of same digits",
      "clinicalSignificance": "**Carpal tunnel syndrome** is the most common nerve compression syndrome, involving median nerve compression within the carpal tunnel. Symptoms include: numbness/tingling in the lateral 3½ digits (worse at night), thenar atrophy (late finding), weakness of thumb opposition and abduction. **Phalen's test** (wrist flexion for 60 seconds) and **Tinel's sign** (tapping over carpal tunnel) are diagnostic maneuvers.\n\n**Pronator syndrome**: Median nerve compression as it passes between the two heads of pronator teres. Unlike carpal tunnel syndrome, causes forearm pain and spares the palm (palmar cutaneous branch given off proximally).\n\n**Anterior interosseous syndrome**: Pure motor syndrome with weakness of flexor pollicis longus, lateral flexor digitorum profundus, and pronator quadratus. Patient cannot make an 'OK' sign (pinch tip of thumb to tip of index finger). No sensory loss.\n\n**Median nerve palsy**: Complete lesions result in: 'Ape hand' deformity (thumb falls back in plane of palm due to thenar atrophy), loss of thumb opposition, weak grip (lateral FDP affected), and sensory loss in lateral 3½ digits.\n\n**'Median nerve prayer sign'**: Inability to fully flex the lateral two digits when attempting to press palms together, seen with high median nerve lesions.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": "Lateral and medial cords of brachial plexus (C6-T1)",
      "bloodSupply": "Brachial artery, anterior interosseous artery, superficial palmar arch",
      "modelReference": "z-anatomy-median-nerve-014",
      "imageReferences": ["grays-1918-plate-813", "grays-1918-plate-816"],
      "difficultyRating": 4,
      "prerequisiteIds": ["str-brachial-plexus-011"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-ulnar-nerve-015",
      "canonicalName": "Ulnar nerve",
      "commonNames": ["Funny bone nerve"],
      "latinName": "Nervus ulnaris",
      "pronunciationIpa": "/ˈʌlnər nɜːrv/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-nervous-003"],
      "structureType": "nerve",
      "parentStructureId": "str-brachial-plexus-011",
      "definitionBrief": "A terminal branch of the medial cord of the brachial plexus (C8-T1) that innervates most intrinsic hand muscles and provides sensation to the medial hand and digits, notorious for vulnerability at the elbow.",
      "descriptionFull": "# Ulnar Nerve\n\nThe ulnar nerve is a terminal branch of the medial cord of the brachial plexus. It is the major nerve supplying the intrinsic muscles of the hand and is particularly vulnerable to injury at the elbow.\n\n## Origin and Course in the Arm\nArises from the **medial cord** of the brachial plexus, receiving fibers primarily from **C8 and T1** (with minor C7 contribution).\n\n**Course**:\n1. Descends medial to the axillary and brachial arteries in the proximal arm\n2. At mid-arm, **pierces the medial intermuscular septum** to enter the posterior compartment\n3. Descends on the anterior surface of the medial head of triceps\n4. Passes **posterior to the medial epicondyle** in the **cubital tunnel** (ulnar groove) - this is where the nerve is most superficial and vulnerable\n5. **Has no branches in the arm**\n\n## Course in the Forearm\n1. Enters forearm by passing between the two heads of **flexor carpi ulnaris**\n2. Descends along the medial aspect of the forearm between flexor carpi ulnaris and flexor digitorum profundus\n3. In the distal forearm, lies lateral to the flexor carpi ulnaris tendon and medial to the ulnar artery\n4. Gives off **dorsal cutaneous branch** approximately 5 cm proximal to the wrist\n5. Passes superficial to (anterior to) the flexor retinaculum through **Guyon's canal**\n\n## Motor Innervation\n\n**In the forearm**:\n- Flexor carpi ulnaris\n- Medial half of flexor digitorum profundus (digits 4-5)\n\n**In the hand** (via deep branch):\n- **All intrinsic hand muscles** EXCEPT the 'LOAF' muscles (innervated by median)\n- Specifically: medial two lumbricals, all interossei (palmar and dorsal), hypothenar muscles, adductor pollicis, and deep head of flexor pollicis brevis\n\n## Sensory Innervation\n- **Palmar cutaneous branch**: Medial palm (does not pass through Guyon's canal)\n- **Dorsal cutaneous branch**: Dorsal medial hand and medial 1½ digits dorsally\n- **Superficial terminal branch**: Palmar surface of medial 1½ digits (little finger and medial half of ring finger)",
      "clinicalSignificance": "**Cubital tunnel syndrome** (ulnar nerve entrapment at the elbow) is the second most common nerve compression syndrome after carpal tunnel syndrome. The nerve is vulnerable because it passes through the **cubital tunnel** (osseofibrous tunnel formed by the medial epicondyle, olecranon, and Osborne's ligament). Symptoms include: numbness in the medial 1½ digits, weakness of intrinsic hand muscles, and positive **Froment's sign** (compensatory thumb IP flexion when attempting to grip paper between thumb and index finger, due to adductor pollicis weakness).\n\n**Guyon's canal syndrome**: Compression at the wrist. Unlike cubital tunnel syndrome, the dorsal cutaneous branch is spared (given off proximal to the wrist), so the dorsal hand has normal sensation. May cause pure motor, pure sensory, or mixed deficits depending on the exact location of compression.\n\n**Ulnar claw hand** (hyperextension at MCP joints, flexion at IP joints of digits 4-5): More pronounced in distal lesions because the medial FDP (which would flex the IP joints) is spared in distal lesions, allowing unopposed action. This is the **'ulnar paradox'** - distal lesions cause worse deformity.\n\n**'Funny bone'** sensation: Striking the ulnar nerve against the medial epicondyle causes instant tingling in the medial 1½ digits due to the nerve's superficial location.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": "Medial cord of brachial plexus (C8, T1)",
      "bloodSupply": "Superior and inferior ulnar collateral arteries, ulnar artery",
      "modelReference": "z-anatomy-ulnar-nerve-015",
      "imageReferences": ["grays-1918-plate-813", "grays-1918-plate-816"],
      "difficultyRating": 4,
      "prerequisiteIds": ["str-brachial-plexus-011"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-brachial-artery-016",
      "canonicalName": "Brachial artery",
      "commonNames": [],
      "latinName": "Arteria brachialis",
      "pronunciationIpa": "/ˈbreɪkiəl ˈɑːrtəri/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-cardiovascular-004"],
      "structureType": "artery",
      "parentStructureId": null,
      "definitionBrief": "The main artery of the arm that is a continuation of the axillary artery, running medially along the arm before dividing into radial and ulnar arteries at the elbow.",
      "descriptionFull": "# Brachial Artery\n\nThe brachial artery is the principal arterial supply to the arm and is the continuation of the axillary artery.\n\n## Origin and Course\n**Begins**: At the inferior border of teres major as a continuation of the **axillary artery**\n\n**Terminates**: In the **cubital fossa** at the level of the radial neck, where it bifurcates into the **radial** and **ulnar** arteries\n\n**Course**: The artery descends along the medial side of the arm:\n1. Runs along the medial aspect of the humerus\n2. Lies initially medial to the humerus, then anterior to it distally\n3. Accompanied by **paired venae comitantes** (brachial veins)\n4. **Median nerve** crosses the artery anteriorly from lateral to medial (usually at mid-arm)\n\n**Surface anatomy**: The artery can be palpated along the medial aspect of the arm and in the cubital fossa. It is the vessel used for blood pressure measurement with a sphygmomanometer.\n\n## Branches\n\n**Major named branches**:\n1. **Profunda brachii artery** (deep brachial artery): Largest branch, accompanies radial nerve in the radial groove, supplies triceps and posterior arm\n2. **Superior ulnar collateral artery**: Accompanies ulnar nerve, pierces medial intermuscular septum\n3. **Inferior ulnar collateral artery**: Arises just proximal to elbow, contributes to collateral circulation\n4. **Muscular branches**: Supply biceps, coracobrachialis, and brachialis\n5. **Nutrient artery**: To humerus\n\n## Collateral Circulation\nExtensive collateral circulation around the elbow allows blood flow even if the brachial artery is temporarily occluded (important during blood pressure measurement). Collateral pathways include anastomoses between:\n- Profunda brachii and radial recurrent arteries\n- Superior/inferior ulnar collateral and ulnar recurrent arteries",
      "clinicalSignificance": "**Volkmann's ischemic contracture**: Can result from brachial artery injury (especially with supracondylar humeral fractures in children) or compartment syndrome. Leads to forearm muscle necrosis, fibrosis, and permanent flexion contracture of the wrist and fingers.\n\n**Supracondylar fractures** in children may lacerate or compress the brachial artery. The **six P's of acute limb ischemia** should be assessed: Pain, Pallor, Pulselessness, Paresthesia, Paralysis, and Poikilothermia (coolness).\n\n**Blood pressure measurement**: The brachial artery is routinely used for auscultatory blood pressure measurement. The cuff is placed around the mid-arm, and **Korotkoff sounds** are auscultated over the artery in the cubital fossa.\n\n**Arterial puncture**: The brachial artery can be accessed for arterial blood gas sampling or angiography in the cubital fossa, though this is less preferred than radial access due to lack of collateral circulation distally if complications occur.\n\n**Brachial artery pulse**: Can be palpated medial to the biceps tendon in the cubital fossa and is used to assess peripheral circulation and in CPR (for infant pulse checks).",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": null,
      "modelReference": "z-anatomy-brachial-artery-016",
      "imageReferences": ["grays-1918-plate-525"],
      "difficultyRating": 3,
      "prerequisiteIds": ["str-humerus-001"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-radial-artery-017",
      "canonicalName": "Radial artery",
      "commonNames": [],
      "latinName": "Arteria radialis",
      "pronunciationIpa": "/ˈreɪdiəl ˈɑːrtəri/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-cardiovascular-004"],
      "structureType": "artery",
      "parentStructureId": "str-brachial-artery-016",
      "definitionBrief": "The lateral terminal branch of the brachial artery that runs along the lateral forearm, supplies the thumb side of the hand, and is the primary vessel for pulse palpation and arterial access.",
      "descriptionFull": "# Radial Artery\n\nThe radial artery is one of the two terminal branches of the brachial artery and is the principal vessel supplying the lateral aspect of the forearm and hand.\n\n## Origin and Course\n**Origin**: Bifurcation of the **brachial artery** in the cubital fossa at the level of the radial neck\n\n**Course in forearm**:\n1. Descends along the lateral (radial) side of the forearm\n2. Lies initially deep to brachioradialis\n3. In the middle third, lies between brachioradialis (laterally) and flexor carpi radialis (medially)\n4. In the distal third, becomes superficial and easily palpable between the flexor carpi radialis tendon (medially) and the distal radius (laterally)\n5. Accompanied by paired venae comitantes\n\n**Course in hand**:\n1. Winds around the **lateral side of the wrist**\n2. Passes through the **anatomical snuffbox** between the tendons of extensor pollicis brevis and extensor pollicis longus\n3. Passes between the two heads of the first dorsal interosseous muscle to enter the palm\n4. Forms the **deep palmar arch** (primarily from radial artery)\n\n## Branches\n\n**In forearm**:\n- **Radial recurrent artery**: Ascends to anastomose with profunda brachii\n- **Palmar carpal branch**: Contributes to palmar carpal arch\n- **Superficial palmar branch**: Completes the superficial palmar arch (mainly from ulnar)\n- **Muscular branches**: To lateral forearm muscles\n\n**At wrist**:\n- **Dorsal carpal branch**: Forms dorsal carpal arch\n- **First dorsal metacarpal artery**: To thumb and index finger\n\n**In hand**:\n- **Princeps pollicis artery**: To thumb\n- **Radialis indicis artery**: To lateral index finger\n- **Deep palmar arch**: Anastomoses with deep branch of ulnar artery",
      "clinicalSignificance": "**Radial pulse**: The radial artery is the most common site for pulse palpation, easily felt between the flexor carpi radialis tendon and the distal radius. The pulse rate, rhythm, and character are routinely assessed here.\n\n**Allen test**: Before radial artery harvest or catheterization, the Allen test assesses adequacy of ulnar collateral blood supply to the hand. Both radial and ulnar arteries are occluded while the patient makes a fist (blanching the hand), then the ulnar artery is released. The hand should flush pink within 5-10 seconds if ulnar collateral circulation is adequate.\n\n**Arterial blood gas sampling**: The radial artery is the preferred site for arterial puncture due to its superficial location, easy palpation, and collateral circulation via the ulnar artery.\n\n**Transradial cardiac catheterization**: Increasingly preferred over transfemoral approach due to lower bleeding complications and earlier ambulation.\n\n**Radial artery harvest**: Can be used as a conduit for coronary artery bypass grafting (CABG), though this is less common than internal thoracic or saphenous vein grafts.\n\n**Anatomical snuffbox**: The radial artery's course through the snuffbox makes this a potential site for palpation, though it's less reliable than the wrist. Tenderness in the snuffbox suggests scaphoid fracture.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": null,
      "modelReference": "z-anatomy-radial-artery-017",
      "imageReferences": ["grays-1918-plate-525", "grays-1918-plate-526"],
      "difficultyRating": 3,
      "prerequisiteIds": ["str-brachial-artery-016"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    },
    {
      "id": "str-ulnar-artery-018",
      "canonicalName": "Ulnar artery",
      "commonNames": [],
      "latinName": "Arteria ulnaris",
      "pronunciationIpa": "/ˈʌlnər ˈɑːrtəri/",
      "regionId": "f6g7h8i9-j0k1-42l3-m4n5-o6p7q8r9s0t1",
      "systemIds": ["sys-cardiovascular-004"],
      "structureType": "artery",
      "parentStructureId": "str-brachial-artery-016",
      "definitionBrief": "The medial and larger terminal branch of the brachial artery that supplies the medial forearm and forms the superficial palmar arch, the primary blood supply to the fingers.",
      "descriptionFull": "# Ulnar Artery\n\nThe ulnar artery is the larger of the two terminal branches of the brachial artery and is the dominant vessel forming the superficial palmar arch.\n\n## Origin and Course\n**Origin**: Bifurcation of the **brachial artery** in the cubital fossa at the level of the radial neck\n\n**Course in forearm**:\n1. Initially passes deep, descending obliquely beneath the pronator teres\n2. Continues deep to the flexor digitorum superficialis\n3. Emerges to lie along the medial (ulnar) side of the forearm\n4. Descends between flexor carpi ulnaris (medially) and flexor digitorum superficialis (laterally)\n5. **Ulnar nerve** lies immediately medial to the artery in the distal two-thirds of the forearm\n6. Accompanied by paired venae comitantes\n\n**Course in hand**:\n1. Passes superficial to (anterior to) the **flexor retinaculum** through **Guyon's canal** (together with ulnar nerve)\n2. In the palm, forms the **superficial palmar arch** (primarily from ulnar artery)\n\n## Branches\n\n**In forearm**:\n- **Anterior ulnar recurrent artery**: Anastomoses with inferior ulnar collateral\n- **Posterior ulnar recurrent artery**: Anastomoses with superior ulnar collateral\n- **Common interosseous artery**: Large branch that quickly divides into:\n  - **Anterior interosseous artery**: Descends on interosseous membrane\n  - **Posterior interosseous artery**: Passes posteriorly above interosseous membrane\n- **Muscular branches**: To medial forearm muscles\n\n**At wrist**:\n- **Palmar carpal branch**: Contributes to palmar carpal arch\n- **Dorsal carpal branch**: Contributes to dorsal carpal arch\n\n**In hand**:\n- **Deep palmar branch**: Anastomoses with radial artery to complete deep arch\n- **Superficial palmar arch**: Gives rise to three **common palmar digital arteries**, which bifurcate into **proper palmar digital arteries** supplying the fingers",
      "clinicalSignificance": "**Superficial palmar arch**: Formed primarily by the ulnar artery (with variable contribution from the superficial palmar branch of the radial artery), this arch supplies the **common and proper digital arteries** to all five digits. The arch is the primary blood supply to the fingers.\n\n**Guyon's canal syndrome**: The ulnar artery and nerve pass through Guyon's canal (ulnar tunnel) at the wrist. Compression here may cause ulnar nerve symptoms and can result from a **hypothenar hammer syndrome** (repetitive trauma to the hypothenar eminence causing ulnar artery thrombosis or aneurysm).\n\n**Allen test**: Tests collateral circulation between radial and ulnar arteries before radial artery procedures. Normal test indicates the ulnar artery (via the superficial palmar arch) can adequately perfuse the hand if the radial artery is compromised.\n\n**High origin of radial artery**: In approximately 15% of people, the radial artery originates more proximally (sometimes from the axillary artery), which may affect surgical approaches and catheterization.\n\n**Ulnar artery pulse**: Less commonly palpated than the radial pulse, but can be felt lateral to the flexor carpi ulnaris tendon at the wrist.",
      "origin": null,
      "insertion": null,
      "action": null,
      "innervation": null,
      "bloodSupply": null,
      "modelReference": "z-anatomy-ulnar-artery-018",
      "imageReferences": ["grays-1918-plate-525", "grays-1918-plate-526"],
      "difficultyRating": 3,
      "prerequisiteIds": ["str-brachial-artery-016"],
      "createdAt": "2024-12-29T00:00:00Z",
      "updatedAt": "2024-12-29T00:00:00Z"
    }
  ],
  "metadata": {
    "region": "upper-limb",
    "version": "1.0",
    "lastUpdated": "2024-12-29T00:00:00Z",
    "totalStructures": 18,
    "structureTypes": {
      "bone": 5,
      "muscle": 5,
      "nerve": 5,
      "artery": 3
    }
  }
}
